prod-deploy/results/prod-nolimit-concurrency-sweep-20260716-081059/randread-sweep-fio-output.txt
bash: warning: setlocale: LC_ALL: cannot change locale (zh_CN.utf8)
LAYOUT_START: Thu Jul 16 09:07:05 +07 2026
storage_test: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes
storage_test: Laying out IO file (1 file / 1024MiB)
storage_test: Laying out IO file (1 file / 1024MiB)
storage_test: Laying out IO file (1 file / 1024MiB)
[...]

storage_test: (groupid=0, jobs=128): err= 0: pid=2471672: Thu Jul 16 09:07:54 2026
  write: IOPS=695, BW=2783MiB/s (2918MB/s)(128GiB/47093msec); 0 zone resets
    slat (usec): min=1765, max=334341, avg=181083.13, stdev=46420.73
    clat (usec): min=2, max=25690k, avg=17457746.78, stdev=8003549.66
     lat (msec): min=2, max=25892, avg=17638.83, stdev=8008.37
    clat percentiles (msec):
     |  1.00th=[  142],  5.00th=[ 1620], 10.00th=[ 3943], 20.00th=[ 8658],
     | 30.00th=[13355], 40.00th=[17113], 50.00th=[17113], 60.00th=[17113],
     | 70.00th=[17113], 80.00th=[17113], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  MiB/s): min= 1447, max= 3852, per=97.60%, avg=2716.60, stdev= 3.90, samples=2964
   iops        : min=  337, max= 1267, avg=680.34, stdev= 1.41, samples=5920
  lat (usec)   : 4=0.03%, 10=0.35%, 20=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%, 20=0.04%, 50=0.10%, 100=0.22%
  lat (msec)   : 250=0.63%, 500=0.76%, 750=0.66%, 1000=0.63%, 2000=2.33%
  lat (msec)   : >=2000=94.22%
  cpu          : usr=0.16%, sys=0.16%, ctx=1049456, majf=2, minf=2163
  IO depths    : 1=0.4%, 2=0.8%, 4=1.6%, 8=3.1%, 16=6.2%, 32=12.5%, >=64=75.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.2%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.8%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=2783MiB/s (2918MB/s), 2783MiB/s-2783MiB/s (2918MB/s-2918MB/s), io=128GiB (137GB), run=47093-47093msec
LAYOUT_DONE: Thu Jul 16 09:07:54 +07 2026
=== randread D0 R1 START: Thu Jul 16 09:08:24 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes

storage_test: (groupid=0, jobs=128): err= 0: pid=2472602: Thu Jul 16 09:11:26 2026
  read: IOPS=11.6k, BW=2891MiB/s (3031MB/s)(508GiB/180021msec)
    slat (usec): min=1189, max=48066, avg=11065.52, stdev=7465.79
    clat (usec): min=2, max=1894.9k, avg=1400050.35, stdev=116599.28
     lat (msec): min=2, max=1911, avg=1411.12, stdev=116.91
    clat percentiles (msec):
     |  1.00th=[ 1167],  5.00th=[ 1250], 10.00th=[ 1284], 20.00th=[ 1334],
     | 30.00th=[ 1351], 40.00th=[ 1385], 50.00th=[ 1401], 60.00th=[ 1435],
     | 70.00th=[ 1452], 80.00th=[ 1485], 90.00th=[ 1519], 95.00th=[ 1552],
     | 99.00th=[ 1636], 99.50th=[ 1653], 99.90th=[ 1720], 99.95th=[ 1737],
     | 99.99th=[ 1787]
   bw (  MiB/s): min= 1695, max= 3501, per=99.81%, avg=2885.33, stdev= 1.85, samples=22896
   iops        : min= 3020, max=15354, avg=11542.16, stdev=10.22, samples=45793
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.02%, 100=0.03%
  lat (msec)   : 250=0.08%, 500=0.14%, 750=0.16%, 1000=0.14%, 2000=99.43%
  cpu          : usr=0.03%, sys=0.21%, ctx=4187709, majf=2, minf=1050728
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=2081727,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=2891MiB/s (3031MB/s), 2891MiB/s-2891MiB/s (3031MB/s-3031MB/s), io=508GiB (546GB), run=180021-180021msec
=== randread D0 R1 DONE: Thu Jul 16 09:11:26 +07 2026 ===
=== randread D0 R2 START: Thu Jul 16 09:11:36 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes

storage_test: (groupid=0, jobs=128): err= 0: pid=2475599: Thu Jul 16 09:14:37 2026
  read: IOPS=11.5k, BW=2873MiB/s (3013MB/s)(505GiB/180036msec)
    slat (usec): min=1151, max=51191, avg=11133.65, stdev=7633.67
    clat (usec): min=2, max=1837.3k, avg=1408467.45, stdev=115538.52
     lat (msec): min=3, max=1858, avg=1419.60, stdev=115.82
    clat percentiles (msec):
     |  1.00th=[ 1183],  5.00th=[ 1267], 10.00th=[ 1301], 20.00th=[ 1334],
     | 30.00th=[ 1368], 40.00th=[ 1385], 50.00th=[ 1418], 60.00th=[ 1435],
     | 70.00th=[ 1469], 80.00th=[ 1485], 90.00th=[ 1536], 95.00th=[ 1569],
     | 99.00th=[ 1636], 99.50th=[ 1653], 99.90th=[ 1703], 99.95th=[ 1737],
     | 99.99th=[ 1770]
   bw (  MiB/s): min= 1479, max= 3495, per=99.81%, avg=2867.53, stdev= 1.89, samples=22899
   iops        : min= 4324, max=15350, avg=11479.49, stdev=10.07, samples=45761
  lat (usec)   : 4=0.01%, 10=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.02%, 100=0.03%
  lat (msec)   : 250=0.08%, 500=0.13%, 750=0.13%, 1000=0.15%, 2000=99.45%
  cpu          : usr=0.03%, sys=0.21%, ctx=4162195, majf=2, minf=1050602
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=2068985,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=2873MiB/s (3013MB/s), 2873MiB/s-2873MiB/s (3013MB/s-3013MB/s), io=505GiB (542GB), run=180036-180036msec
=== randread D0 R2 DONE: Thu Jul 16 09:14:37 +07 2026 ===
=== randread D0 R3 START: Thu Jul 16 09:14:47 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes

storage_test: (groupid=0, jobs=128): err= 0: pid=2478215: Thu Jul 16 09:17:49 2026
  read: IOPS=11.6k, BW=2897MiB/s (3038MB/s)(509GiB/180030msec)
    slat (usec): min=1198, max=47660, avg=11039.86, stdev=7408.55
    clat (usec): min=2, max=1860.5k, avg=1396804.57, stdev=113851.54
     lat (msec): min=2, max=1881, avg=1407.84, stdev=114.12
    clat percentiles (msec):
     |  1.00th=[ 1167],  5.00th=[ 1250], 10.00th=[ 1284], 20.00th=[ 1318],
     | 30.00th=[ 1351], 40.00th=[ 1385], 50.00th=[ 1401], 60.00th=[ 1418],
     | 70.00th=[ 1452], 80.00th=[ 1469], 90.00th=[ 1519], 95.00th=[ 1552],
     | 99.00th=[ 1620], 99.50th=[ 1636], 99.90th=[ 1687], 99.95th=[ 1720],
     | 99.99th=[ 1787]
   bw (  MiB/s): min= 1662, max= 3503, per=99.82%, avg=2892.12, stdev= 1.83, samples=22892
   iops        : min= 3360, max=15294, avg=11569.67, stdev=10.07, samples=45786
  lat (usec)   : 4=0.01%, 10=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.02%, 100=0.03%
  lat (msec)   : 250=0.09%, 500=0.14%, 750=0.14%, 1000=0.14%, 2000=99.44%
  cpu          : usr=0.03%, sys=0.21%, ctx=4197324, majf=11, minf=1050767
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=2086522,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=2897MiB/s (3038MB/s), 2897MiB/s-2897MiB/s (3038MB/s-3038MB/s), io=509GiB (547GB), run=180030-180030msec
=== randread D0 R3 DONE: Thu Jul 16 09:17:49 +07 2026 ===
=== randread D1 R1 START: Thu Jul 16 09:17:59 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=16
...
fio-3.28
Starting 32 processes

storage_test: (groupid=0, jobs=32): err= 0: pid=2480822: Thu Jul 16 09:21:00 2026
  read: IOPS=9335, BW=2334MiB/s (2447MB/s)(410GiB/180005msec)
    slat (usec): min=1072, max=15310, avg=3426.39, stdev=1220.42
    clat (nsec): min=1115, max=94140k, avg=51406107.22, stdev=5025621.40
     lat (usec): min=1330, max=100609, avg=54832.69, stdev=5201.57
    clat percentiles (usec):
     |  1.00th=[41157],  5.00th=[43779], 10.00th=[45351], 20.00th=[47449],
     | 30.00th=[48497], 40.00th=[50070], 50.00th=[51119], 60.00th=[52167],
     | 70.00th=[53740], 80.00th=[55313], 90.00th=[57934], 95.00th=[60031],
     | 99.00th=[64750], 99.50th=[66847], 99.90th=[71828], 99.95th=[74974],
     | 99.99th=[80217]
   bw (  MiB/s): min= 2053, max= 2487, per=99.99%, avg=2333.71, stdev= 2.11, samples=5759
   iops        : min= 7860, max=10188, avg=9333.22, stdev=10.75, samples=11519
  lat (usec)   : 2=0.01%, 4=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=40.81%
  lat (msec)   : 100=59.18%
  cpu          : usr=0.05%, sys=0.45%, ctx=3367439, majf=3, minf=33228
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1680491,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=2334MiB/s (2447MB/s), 2334MiB/s-2334MiB/s (2447MB/s-2447MB/s), io=410GiB (441GB), run=180005-180005msec
=== randread D1 R1 DONE: Thu Jul 16 09:21:00 +07 2026 ===
=== randread D1 R2 START: Thu Jul 16 09:21:10 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=16
...
fio-3.28
Starting 32 processes

storage_test: (groupid=0, jobs=32): err= 0: pid=2483701: Thu Jul 16 09:24:11 2026
  read: IOPS=9385, BW=2346MiB/s (2460MB/s)(412GiB/180004msec)
    slat (usec): min=1080, max=14065, avg=3408.18, stdev=1190.24
    clat (nsec): min=1033, max=80063k, avg=51132897.41, stdev=4848135.01
     lat (usec): min=1677, max=83239, avg=54541.27, stdev=5012.02
    clat percentiles (usec):
     |  1.00th=[40633],  5.00th=[43779], 10.00th=[45351], 20.00th=[46924],
     | 30.00th=[48497], 40.00th=[49546], 50.00th=[51119], 60.00th=[52167],
     | 70.00th=[53216], 80.00th=[54789], 90.00th=[57410], 95.00th=[59507],
     | 99.00th=[63701], 99.50th=[65274], 99.90th=[68682], 99.95th=[69731],
     | 99.99th=[72877]
   bw (  MiB/s): min= 2156, max= 2506, per=99.99%, avg=2346.22, stdev= 1.79, samples=5754
   iops        : min= 8092, max=10276, avg=9383.21, stdev= 9.70, samples=11514
  lat (usec)   : 2=0.01%, 4=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=42.43%
  lat (msec)   : 100=57.56%
  cpu          : usr=0.05%, sys=0.45%, ctx=3385404, majf=5, minf=33275
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1689468,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=2346MiB/s (2460MB/s), 2346MiB/s-2346MiB/s (2460MB/s-2460MB/s), io=412GiB (443GB), run=180004-180004msec
=== randread D1 R2 DONE: Thu Jul 16 09:24:11 +07 2026 ===
=== randread D1 R3 START: Thu Jul 16 09:24:21 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=16
...
fio-3.28
Starting 32 processes

storage_test: (groupid=0, jobs=32): err= 0: pid=2485809: Thu Jul 16 09:27:23 2026
  read: IOPS=9404, BW=2351MiB/s (2465MB/s)(413GiB/180004msec)
    slat (usec): min=1144, max=12519, avg=3401.44, stdev=1172.62
    clat (nsec): min=1100, max=81346k, avg=51032455.99, stdev=4770413.59
     lat (usec): min=1829, max=83865, avg=54434.09, stdev=4931.75
    clat percentiles (usec):
     |  1.00th=[41157],  5.00th=[43779], 10.00th=[45351], 20.00th=[46924],
     | 30.00th=[48497], 40.00th=[49546], 50.00th=[50594], 60.00th=[52167],
     | 70.00th=[53216], 80.00th=[54789], 90.00th=[57410], 95.00th=[58983],
     | 99.00th=[63177], 99.50th=[64750], 99.90th=[68682], 99.95th=[69731],
     | 99.99th=[71828]
   bw (  MiB/s): min= 2162, max= 2492, per=99.99%, avg=2350.80, stdev= 1.68, samples=5758
   iops        : min= 8114, max=10274, avg=9401.56, stdev= 9.42, samples=11518
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=43.16%
  lat (msec)   : 100=56.82%
  cpu          : usr=0.05%, sys=0.45%, ctx=3392045, majf=2, minf=33259
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1692794,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=2351MiB/s (2465MB/s), 2351MiB/s-2351MiB/s (2465MB/s-2465MB/s), io=413GiB (444GB), run=180004-180004msec
=== randread D1 R3 DONE: Thu Jul 16 09:27:23 +07 2026 ===
=== randread D2 R1 START: Thu Jul 16 09:27:33 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=8
...
fio-3.28
Starting 16 processes

storage_test: (groupid=0, jobs=16): err= 0: pid=2488741: Thu Jul 16 09:30:34 2026
  read: IOPS=7354, BW=1839MiB/s (1928MB/s)(323GiB/180002msec)
    slat (usec): min=1052, max=11920, avg=2174.54, stdev=492.92
    clat (nsec): min=993, max=27814k, avg=15228066.26, stdev=1376768.09
     lat (usec): min=1392, max=29867, avg=17402.76, stdev=1479.48
    clat percentiles (usec):
     |  1.00th=[12387],  5.00th=[13173], 10.00th=[13566], 20.00th=[14091],
     | 30.00th=[14484], 40.00th=[14746], 50.00th=[15139], 60.00th=[15533],
     | 70.00th=[15926], 80.00th=[16319], 90.00th=[16909], 95.00th=[17695],
     | 99.00th=[18744], 99.50th=[19268], 99.90th=[20579], 99.95th=[21103],
     | 99.99th=[22676]
   bw (  MiB/s): min= 1752, max= 1913, per=100.00%, avg=1838.71, stdev= 1.73, samples=2876
   iops        : min= 6896, max= 7758, avg=7353.83, stdev= 8.94, samples=5756
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=99.78%, 50=0.21%
  cpu          : usr=0.06%, sys=0.59%, ctx=2650986, majf=2, minf=11496
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1323833,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1839MiB/s (1928MB/s), 1839MiB/s-1839MiB/s (1928MB/s-1928MB/s), io=323GiB (347GB), run=180002-180002msec
=== randread D2 R1 DONE: Thu Jul 16 09:30:34 +07 2026 ===
=== randread D2 R2 START: Thu Jul 16 09:30:44 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=8
...
fio-3.28
Starting 16 processes

storage_test: (groupid=0, jobs=16): err= 0: pid=2490828: Thu Jul 16 09:33:45 2026
  read: IOPS=7369, BW=1842MiB/s (1932MB/s)(324GiB/180002msec)
    slat (usec): min=1090, max=10137, avg=2169.98, stdev=487.59
    clat (nsec): min=1170, max=25662k, avg=15196309.50, stdev=1357959.07
     lat (usec): min=1634, max=28891, avg=17366.44, stdev=1458.69
    clat percentiles (usec):
     |  1.00th=[12387],  5.00th=[13173], 10.00th=[13566], 20.00th=[14091],
     | 30.00th=[14484], 40.00th=[14746], 50.00th=[15139], 60.00th=[15401],
     | 70.00th=[15795], 80.00th=[16319], 90.00th=[16909], 95.00th=[17695],
     | 99.00th=[18744], 99.50th=[19268], 99.90th=[20317], 99.95th=[20841],
     | 99.99th=[21890]
   bw (  MiB/s): min= 1768, max= 1916, per=100.00%, avg=1842.61, stdev= 1.63, samples=2879
   iops        : min= 6904, max= 7766, avg=7369.36, stdev= 8.93, samples=5759
  lat (usec)   : 2=0.01%, 4=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=99.84%, 50=0.16%
  cpu          : usr=0.06%, sys=0.58%, ctx=2656433, majf=2, minf=10662
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1326610,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1842MiB/s (1932MB/s), 1842MiB/s-1842MiB/s (1932MB/s-1932MB/s), io=324GiB (348GB), run=180002-180002msec
=== randread D2 R2 DONE: Thu Jul 16 09:33:45 +07 2026 ===
=== randread D2 R3 START: Thu Jul 16 09:33:55 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=8
...
fio-3.28
Starting 16 processes

storage_test: (groupid=0, jobs=16): err= 0: pid=2493709: Thu Jul 16 09:36:56 2026
  read: IOPS=7355, BW=1839MiB/s (1928MB/s)(323GiB/180003msec)
    slat (usec): min=1099, max=8745, avg=2174.19, stdev=487.72
    clat (nsec): min=1032, max=24630k, avg=15225778.89, stdev=1359502.62
     lat (usec): min=1314, max=27815, avg=17400.12, stdev=1460.37
    clat percentiles (usec):
     |  1.00th=[12387],  5.00th=[13173], 10.00th=[13566], 20.00th=[14091],
     | 30.00th=[14484], 40.00th=[14746], 50.00th=[15139], 60.00th=[15533],
     | 70.00th=[15795], 80.00th=[16319], 90.00th=[16909], 95.00th=[17695],
     | 99.00th=[18744], 99.50th=[19268], 99.90th=[20579], 99.95th=[21103],
     | 99.99th=[22152]
   bw (  MiB/s): min= 1766, max= 1909, per=100.00%, avg=1838.99, stdev= 1.58, samples=2878
   iops        : min= 6948, max= 7788, avg=7355.03, stdev= 8.39, samples=5758
  lat (usec)   : 2=0.01%, 4=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=99.80%, 50=0.20%
  cpu          : usr=0.06%, sys=0.59%, ctx=2651284, majf=2, minf=11632
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1324044,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1839MiB/s (1928MB/s), 1839MiB/s-1839MiB/s (1928MB/s-1928MB/s), io=323GiB (347GB), run=180003-180003msec
=== randread D2 R3 DONE: Thu Jul 16 09:36:56 +07 2026 ===
=== randread D3 R1 START: Thu Jul 16 09:37:06 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=4
...
fio-3.28
Starting 8 processes

storage_test: (groupid=0, jobs=8): err= 0: pid=2496698: Thu Jul 16 09:40:07 2026
  read: IOPS=4853, BW=1213MiB/s (1272MB/s)(213GiB/180002msec)
    slat (usec): min=1067, max=6888, avg=1647.33, stdev=249.96
    clat (nsec): min=936, max=10386k, avg=4944862.60, stdev=447329.97
     lat (usec): min=1447, max=12099, avg=6592.33, stdev=523.52
    clat percentiles (usec):
     |  1.00th=[ 4080],  5.00th=[ 4293], 10.00th=[ 4424], 20.00th=[ 4555],
     | 30.00th=[ 4686], 40.00th=[ 4817], 50.00th=[ 4883], 60.00th=[ 5014],
     | 70.00th=[ 5145], 80.00th=[ 5276], 90.00th=[ 5538], 95.00th=[ 5735],
     | 99.00th=[ 6128], 99.50th=[ 6325], 99.90th=[ 6718], 99.95th=[ 6915],
     | 99.99th=[ 7439]
   bw (  MiB/s): min= 1183, max= 1260, per=100.00%, avg=1213.54, stdev= 1.67, samples=1439
   iops        : min= 4678, max= 5072, avg=4854.04, stdev= 8.60, samples=2879
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%
  lat (msec)   : 2=0.01%, 4=0.42%, 10=99.58%, 20=0.01%
  cpu          : usr=0.06%, sys=0.73%, ctx=1748951, majf=2, minf=3275
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=873681,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=1213MiB/s (1272MB/s), 1213MiB/s-1213MiB/s (1272MB/s-1272MB/s), io=213GiB (229GB), run=180002-180002msec
=== randread D3 R1 DONE: Thu Jul 16 09:40:07 +07 2026 ===
=== randread D3 R2 START: Thu Jul 16 09:40:17 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=4
...
fio-3.28
Starting 8 processes

storage_test: (groupid=0, jobs=8): err= 0: pid=2498796: Thu Jul 16 09:43:18 2026
  read: IOPS=4856, BW=1214MiB/s (1273MB/s)(213GiB/180002msec)
    slat (usec): min=1026, max=6931, avg=1646.48, stdev=247.80
    clat (nsec): min=780, max=11530k, avg=4942326.50, stdev=444745.63
     lat (usec): min=1224, max=13844, avg=6588.95, stdev=520.89
    clat percentiles (usec):
     |  1.00th=[ 4080],  5.00th=[ 4293], 10.00th=[ 4424], 20.00th=[ 4555],
     | 30.00th=[ 4686], 40.00th=[ 4817], 50.00th=[ 4883], 60.00th=[ 5014],
     | 70.00th=[ 5145], 80.00th=[ 5276], 90.00th=[ 5538], 95.00th=[ 5735],
     | 99.00th=[ 6128], 99.50th=[ 6325], 99.90th=[ 6718], 99.95th=[ 6849],
     | 99.99th=[ 7242]
   bw (  MiB/s): min= 1181, max= 1253, per=100.00%, avg=1214.16, stdev= 1.70, samples=1435
   iops        : min= 4658, max= 5094, avg=4856.54, stdev= 8.73, samples=2875
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%
  lat (msec)   : 2=0.01%, 4=0.41%, 10=99.59%, 20=0.01%
  cpu          : usr=0.06%, sys=0.71%, ctx=1749850, majf=2, minf=3266
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=874128,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=1214MiB/s (1273MB/s), 1214MiB/s-1214MiB/s (1273MB/s-1273MB/s), io=213GiB (229GB), run=180002-180002msec
=== randread D3 R2 DONE: Thu Jul 16 09:43:18 +07 2026 ===
=== randread D3 R3 START: Thu Jul 16 09:43:28 +07 2026 ===
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=4
...
fio-3.28
Starting 8 processes

storage_test: (groupid=0, jobs=8): err= 0: pid=2501720: Thu Jul 16 09:46:29 2026
  read: IOPS=4858, BW=1215MiB/s (1274MB/s)(213GiB/180002msec)
    slat (usec): min=1057, max=6320, avg=1645.81, stdev=247.23
    clat (nsec): min=907, max=10837k, avg=4940307.18, stdev=442738.36
     lat (usec): min=1520, max=13145, avg=6586.25, stdev=518.33
    clat percentiles (usec):
     |  1.00th=[ 4080],  5.00th=[ 4293], 10.00th=[ 4424], 20.00th=[ 4555],
     | 30.00th=[ 4686], 40.00th=[ 4817], 50.00th=[ 4883], 60.00th=[ 5014],
     | 70.00th=[ 5145], 80.00th=[ 5276], 90.00th=[ 5538], 95.00th=[ 5735],
     | 99.00th=[ 6128], 99.50th=[ 6325], 99.90th=[ 6718], 99.95th=[ 6849],
     | 99.99th=[ 7308]
   bw (  MiB/s): min= 1183, max= 1252, per=100.00%, avg=1214.66, stdev= 1.60, samples=1439
   iops        : min= 4672, max= 5074, avg=4858.52, stdev= 8.53, samples=2879
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%
  lat (msec)   : 2=0.01%, 4=0.39%, 10=99.61%, 20=0.01%
  cpu          : usr=0.06%, sys=0.71%, ctx=1750534, majf=4, minf=3005
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=874484,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=1215MiB/s (1274MB/s), 1215MiB/s-1215MiB/s (1274MB/s-1274MB/s), io=213GiB (229GB), run=180002-180002msec
=== randread D3 R3 DONE: Thu Jul 16 09:46:29 +07 2026 ===
ALL_DONE